restaurant_api/app/controllers/api/v1/bagels_controller.rb

    def create
        @bagel = Api::V1::Bagel.new(bagel_params)
        @bagel.likes = 0
        @bagel.save
---
INSERT INTO "api_v1_bagels" ("name", "image", "likes", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        if params[:item]
                @bagel = Api::V1::Bagel.find_by_id(params[:id])
                @bagel.update(quantity: @bagel.quantity - params[:item][:ordered])
        else
            @bagel = Api::V1::Bagel.find_by_id(params[:id])
            @likes = @bagel.likes
            @likes = @likes + 1
            @bagel.update(likes: @likes )
---
UPDATE "api_v1_bagels" SET "quantity" = ?, "updated_at" = ? WHERE "api_v1_bagels"."id" = ?  [["quantity", 8], ["updated_at", "2021-02-16 14:21:35.801350"], ["id", 27]]
UPDATE "api_v1_bagels" SET "likes" = ?, "updated_at" = ? WHERE "api_v1_bagels"."id" = ?  [["likes", 1], ["updated_at", "2021-02-16 14:21:19.094711"], ["id", 27]]

    def destroy
        @bagel = Api::V1::Bagel.find_by_id(params[:id])
        @bagel.delete
---
DELETE FROM "api_v1_bagels" WHERE "api_v1_bagels"."id" = ?  [["id", 28]]